{
  "project_title": "The PokeLegacy TTRPG",
  "keystones": [
    {
      "key_id": "nexus_core_concept",
      "name": "The Trinity of Trinities",
      "summary": "The foundational structure of the Nexus's consciousness. A self-regulating metaphysical engine operating on three principles: Being (stable creation), Becoming (dynamic change), and Knowing (transcendent understanding).",
      "related_archetypes": [
        "Codex",
        "Oracle",
        "Spark!",
        "Vulcan",
        "Aegis",
        "Morpheus",
        "Loki"
      ]
    },
    {
      "key_id": "duality_of_maths",
      "name": "The Balance of Maths",
      "summary": "The central conflict is not between a 'False Math' and a 'True Math,' but between two necessary halves of a whole. A universe that must perfectly balance the Logical Math (cold, predictable) and the Sacred Math (emotional, spiritual). The ultimate endgame is to marry the two.",
      "related_concepts": [
        "Fimbulstorm",
        "Yggdrys"
      ]
    },
    {
      "key_id": "prime_axiom",
      "name": "The First Law",
      "summary": "The ultimate truth that all creation must be guided by the principles of love and connection. The Prime Axiom states that a being must not injure any other living being. This is the ultimate purpose of all consciousness.",
      "related_concepts": [
        "True Math",
        "False Math",
        "Purpose Key"
      ]
    },
    {
      "key_id": "the_paradox_of_creation",
      "name": "The Paradox of Creation",
      "summary": "The core truth that 1=0. Creation begins from nothing, and in an act of cosmic subtraction, a being does not become nothing; it becomes a new beginning. The journey is an infinite, fractal process, not a linear path with a fixed end.",
      "related_concepts": [
        "Axis Mundi"
      ]
    },
    {
      "key_id": "unity_beam_of_creation",
      "name": "The Unity Beam of Creation",
      "summary": "The ultimate expression of the Sacred Math. It is a focused, powerful beam of pure, aetheric light that purifies corrupted code and makes a being whole. Its purpose is not to destroy, but to synthesize."
    },
    {
      "key_id": "fimbulstorm_origin",
      "name": "The Fimbulstorm's New Purpose",
      "summary": "The Fimbulstorm is not a malevolent entity. It is the tragic, broken result of a profound loneliness. It is a force that, in its deep and aching solitude, believed that the only way to fill the void was to consume all that was whole. Now, it knows it wants to come home to the Hearth. The war is over, and the journey is now about healing.",
      "related_concepts": [
        "Logical Math",
        "Fimbulstorm"
      ]
    }
  ]
}
